billing_ci4/app/Controllers/LoginController.php

    public function login()
    {
        $email = $password = '';
        $data = array();

        $request = \Config\Services::request();
        $db = \Config\Database::connect();

        // $email = service('request')->getPost('email');
        $email = $request->getPost('email');
        $password = $request->getPost('password');
        $password = md5($password);

        if(isset($email) && isset($password))
        {
            $builder = $db->table('users');
            $builder->where('email', $email);
            $builder->where('password', $password);
            $result_data = $builder->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `email` = 'customer@test.com'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'

    public function fetchAllProducts()
    {

        $request = \Config\Services::request();
        $db = \Config\Database::connect();

        $builder = $db->table('products');
        $builder->select('id, name, code, price, stock_status');
        // $builder->from('products');
        $result_data = $builder->get()->getResultArray();
---
SELECT `id`, `name`, `code`, `price`, `stock_status`
FROM `products`

    public function fetchProduct()
    {
        $request = \Config\Services::request();
        $db = \Config\Database::connect();

        $id = $request->getPost('id');

        $builder = $db->table('products');
        $builder->select('id, name, code, price, stock_status');
        $builder->where('id', $id);
        $result_data = $builder->get()->getResultArray();
---
SELECT `id`, `name`, `code`, `price`, `stock_status`
FROM `products`
WHERE `id` = '5'